<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Название таблиц
    |--------------------------------------------------------------------------
    */
    'tables' => [
        'users' => 'users',
        'users_groups' => 'users_groups',
        'permissions' => 'permissions',
        'users_groups_permissions' => 'users_groups_permissions',
        'users_permissions' => 'users_permissions',
        'relations' => [
            'user_group_field' => 'group_id',
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Название таблиц
    |--------------------------------------------------------------------------
    */
    'super_user_group_id' => 7,

    /*
    |--------------------------------------------------------------------------
    | Список базовых групп, запрещенных к изменению
    |--------------------------------------------------------------------------
    */
    'blocked_group_ids' => [1, 2, 3, 4, 7],

    /*
    |--------------------------------------------------------------------------
    | Список групп простых пользователей без прав
    |--------------------------------------------------------------------------
    */
    'users_groups_without_permissions' => [],

    /*
    |--------------------------------------------------------------------------
    | Настройка роута страницы управления правами
    |--------------------------------------------------------------------------
    */
    'route' => [
        'domain' => null,
        'path' => '/permissions',
        'middleware' => ['web'],
    ],

    /*
    |--------------------------------------------------------------------------
    | Дополнительные правила в формате 'name' => [user_ids]
    |--------------------------------------------------------------------------
    */
    'additions' => [],

    /*
    |--------------------------------------------------------------------------
    | View settings
    |--------------------------------------------------------------------------
    */
    'view' => [
        'back_url' => '/',
    ],

    /*
    |--------------------------------------------------------------------------
    | Группы разрешений для группировки при выводе
    |--------------------------------------------------------------------------
    |
    */
    'permissions_groups' => [
        'Основные',
        'Статистика',
        'Заказы',
        'Финансы',
        'Реклама',
        'Пользователи',
        'SEO',
        'Разное',
    ],

    //todo удалить после выполнения миграции
    'permissions_groups_replace' => [
        'main',
        'statistic',
        'order',
        'finances',
        'ads',
        'user',
        'seo',
        'other',
    ],

];